source/app/Http/Controllers/DashboardController.php

    public function index(Request $request)
    {
        $user = $request->user();

        // Get active games (open status)
        $activeGames = Game::where('status', 'open')
            ->where('lock_date', '>', now())
            ->orderBy('lock_date', 'asc')
            ->with('creator')
            ->limit(5)
            ->get()
            ->map(function ($game) use ($user) {
                // Check if user has submitted
                $userSubmission = Submission::where('game_id', $game->id)
                    ->where('user_id', $user->id)
                    ->first();

                return [
                    'id' => $game->id,
                    'name' => $game->name,
                    'event_type' => $game->event_type,
                    'event_date' => $game->event_date,
                    'lock_date' => $game->lock_date,
                    'status' => $game->status,
                    'questions_count' => $game->questions()->count(),
                    'has_submitted' => $userSubmission !== null,
                    'submission_complete' => $userSubmission?->is_complete ?? false,
                ];
            });
---
select * from `games` where `status` = 'open' and `lock_date` > '2025-11-18 19:51:26' order by `lock_date` asc limit 5
select * from `users` where `users`.`id` in (1)
select * from `submissions` where `game_id` = 2 and `user_id` = 1 limit 1
select count(*) as aggregate from `questions` where `questions`.`game_id` = 2 and `questions`.`game_id` is not null

            });

        // Get recent results (completed games with user submissions)
        $recentResults = Leaderboard::where('user_id', $user->id)
            ->whereHas('game', function ($query) {
                $query->where('status', 'completed');
            })
            ->with(['game', 'group'])
            ->orderBy('created_at', 'desc')
            ->limit(5)
            ->get()
            ->map(function ($leaderboard) {
                return [
                    'game_name' => $leaderboard->game->name,
                    'group_name' => $leaderboard->group?->name ?? 'Global',
                    'rank' => $leaderboard->rank,
                    'total_score' => $leaderboard->total_score,
                    'possible_points' => $leaderboard->possible_points,
                    'percentage' => $leaderboard->percentage,
                ];
            });

        // Get participation statistics
        $stats = [
            'total_games' => Submission::where('user_id', $user->id)->distinct('game_id')->count('game_id'),
            'total_submissions' => Submission::where('user_id', $user->id)->count(),
            'groups_count' => $user->groups()->count(),
            'average_score' => (float) (Submission::where('user_id', $user->id)
                ->where('is_complete', true)
                ->avg('percentage') ?? 0),
        ];
---
select * from `leaderboards` where `user_id` = 1 and exists (select * from `games` where `leaderboards`.`game_id` = `games`.`id` and `status` = 'completed') order by `created_at` desc limit 5
select avg(`percentage`) as aggregate from `submissions` where `user_id` = 1 and `is_complete` = 1
select count(*) as aggregate from `submissions` where `user_id` = 1
select count(*) as aggregate from `groups` inner join `user_groups` on `groups`.`id` = `user_groups`.`group_id` where `user_groups`.`user_id` = 1