source/app/Http/Controllers/Admin/GameController.php

select count(*) as aggregate from `games`
---
    public function index(Request $request)
    {
        $query = Game::with('creator')
            ->withCount(['questions', 'submissions']);

        // Filter by status
        if ($request->has('status') && $request->status !== 'all') {
            $query->where('status', $request->status);
        }

        // Search
        if ($request->has('search') && $request->search) {
            $query->where(function ($q) use ($request) {
                $q->where('name', 'like', "%{$request->search}%")
                  ->orWhere('event_type', 'like', "%{$request->search}%");
            });
        }

        $games = $query->latest()->paginate(15);

select * from `groups` where `groups`.`id` in (1, 2, 3, 4, 5)
select * from `questions` where `questions`.`game_id` in (1) order by `display_order` asc, `display_order` asc
select * from `group_question_answers` where `group_question_answers`.`question_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select `id`, (select count(*) from `submissions` where `games`.`id` = `submissions`.`game_id`) as `submissions_count`, (select count(*) from `questions` where `games`.`id` = `questions`.`game_id`) as `questions_count` from `games` where `games`.`id` in (1)
select count(*) as aggregate from `submissions` where `submissions`.`game_id` = 1 and `submissions`.`game_id` is not null and `is_complete` = 1
select avg(`percentage`) as aggregate from `submissions` where `submissions`.`game_id` = 1 and `submissions`.`game_id` is not null and `is_complete` = 1
---
    public function show(Game $game)
    {
        $game->load([
            'creator',
            'questions' => function ($query) {
                $query->orderBy('display_order');
            },
            'invitations.group',
        ]);

        $game->loadCount(['submissions', 'questions']);

        // Get all groups that have answers for this game
        $groupsWithAnswers = $game->questions()
            ->with('groupQuestionAnswers.group')
            ->get()
            ->pluck('groupQuestionAnswers')
            ->flatten()
            ->pluck('group')
            ->unique('id')
            ->values();

        // Calculate statistics
        $stats = [
            'total_questions' => $game->questions_count,
            'total_submissions' => $game->submissions_count,
            'completed_submissions' => $game->submissions()->where('is_complete', true)->count(),
            'average_score' => (float) ($game->submissions()
                ->where('is_complete', true)
                ->avg('percentage') ?? 0),
        ];

select count(*) as aggregate from `questions` where `questions`.`game_id` = 1 and `questions`.`game_id` is not null
select count(distinct `user_id`) as aggregate from `submissions` where `submissions`.`game_id` = 1 and `submissions`.`game_id` is not null
select min(`percentage`) as aggregate from `submissions` where `submissions`.`game_id` = 1 and `submissions`.`game_id` is not null and `is_complete` = 1
select * from `submissions` where `submissions`.`game_id` = 1 and `submissions`.`game_id` is not null and `is_complete` = 1
select * from `groups` where `groups`.`id` in (1, 2, 3, 4, 5)
---
    public function statistics(Game $game)
    {
        $stats = [
            'total_submissions' => $game->submissions()->count(),
            'completed_submissions' => $game->submissions()->where('is_complete', true)->count(),
            'pending_submissions' => $game->submissions()->where('is_complete', false)->count(),
            'average_score' => $game->submissions()->where('is_complete', true)->avg('percentage') ?? 0,
            'highest_score' => $game->submissions()->where('is_complete', true)->max('percentage') ?? 0,
            'lowest_score' => $game->submissions()->where('is_complete', true)->min('percentage') ?? 0,
            'total_participants' => $game->submissions()->distinct('user_id')->count('user_id'),
            'questions_count' => $game->questions()->count(),
        ];

        // Submissions by group
        $submissionsByGroup = $game->submissions()
            ->with('group')
            ->where('is_complete', true)
            ->get()
            ->groupBy('group_id')
            ->map(function ($submissions, $groupId) {
                $group = $submissions->first()->group;
                return [
                    'group_name' => $group->name,
                    'count' => $submissions->count(),
                    'average_score' => $submissions->avg('percentage'),
                ];
            })
            ->values();