source/app/Http/Controllers/Admin/GradingController.php

select * from `questions` where `questions`.`game_id` = 1 and `questions`.`game_id` is not null order by `display_order` asc, `display_order` asc
select * from `group_question_answers` where `question_id` in (4, 8, 3, 9, 2, 6, 10, 7, 5, 1)
select * from `groups` where `groups`.`id` in (1, 2, 3, 4, 5)
select * from `questions` where `questions`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
---
    public function index(Game $game)
    {
        // Get all questions for this game
        $questions = $game->questions()
            ->orderBy('display_order')
            ->get();

        // Get all groups (admins need to set answers before anyone submits)
        $groups = Group::withCount('users')->orderBy('name')->get();

        // Get all group question answers for this game
        $groupAnswers = GroupQuestionAnswer::whereIn('question_id', $questions->pluck('id'))
            ->with(['group', 'question'])
            ->get()
            ->groupBy('group_id');