source/app/Http/Controllers/Admin/QuestionController.php

    public function index(Game $game)
    {
        $questions = $game->questions()
            ->orderBy('display_order')
            ->get();
---
select * from `questions` where `questions`.`game_id` = 1 and `questions`.`game_id` is not null order by `display_order` asc, `display_order` asc